const foods = {
    halal: {
        "ข้าวหมกไก่": "ฮาลาล",
        "แกงเขียวหวานไก่": "ฮาลาล",
        "ผัดไทยกุ้งสด": "ฮาลาล",
        "ต้มยำกุ้ง": "ฮาลาล",
        "ข้าวมันไก่": "ฮาลาล",
        "ข้าวผัดปลาเค็ม": "ฮาลาล",
        "โรตีมะตะบะ": "ฮาลาล",
        "แกงมัสมั่น": "ฮาลาล",
        "ส้มตำปูปลาร้า": "ฮาลาล",
        "ลาบไก่ฮาลาล": "ฮาลาล",
        "ก๋วยเตี๋ยวไก่มุสลิม": "ฮาลาล",
        "ข้าวยำปักษ์ใต้": "ฮาลาล",
        "ข้าวเหนียวมะม่วง": "ฮาลาล"
    },
    nonHalal: {
        "ข้าวหมูกรอบ": "ไม่ฮาลาล",
        "ก๋วยเตี๋ยวหมู": "ไม่ฮาลาล",
        "ส้มตำปูปลาร้า": "ไม่ฮาลาล",
        "หมูสะเต๊ะ": "ไม่ฮาลาล",
        "ข้าวผัดกะเพราหมู": "ไม่ฮาลาล",
        "แกงจืดหมูสับ": "ไม่ฮาลาล",
        "ผัดกะเพรา": "ไม่ฮาลาล",
        "ผัดซีอิ๊ว": "ไม่ฮาลาล",
        "ข้าวผัด": "ไม่ฮาลาล",
        "ราดหน้า": "ไม่ฮาลาล",
        "ผัดไทย": "ไม่ฮาลาล",
        "ไข่เจียว": "ไม่ฮาลาล",
        "ผัดพริกแกง": "ไม่ฮาลาล",
        "ข้าวหมูทอดกระเทียม": "ไม่ฮาลาล",
        "ข้าวคลุกกะปิ": "ไม่ฮาลาล",
        "ต้มยำ": "ไม่ฮาลาล"
    }
};
